export const pageTitles = {
    'school': 'Генератор XLSX файлов для школ',
    'dou': 'Генератор XLSX файлов для ДОУ',
    'spo': 'Генератор XLSX файлов для СПО',
    'udo': 'Генератор XLSX файлов для УДО'
};

export const pageSubtitles = {
    'school': 'Заполнение тестовыми данными шаблонов импорта Школ',
    'dou': 'Заполнение тестовыми данными шаблонов импорта ДОУ',
    'spo': 'Заполнение тестовыми данными шаблонов импорта СПО',
    'udo': 'Заполнение тестовыми данными шаблонов импорта УДО'
};

export const maleFirstNames = [
    'Александр', 'Алексей', 'Андрей', 'Антон', 'Артем',
    'Борис', 'Вадим', 'Валентин', 'Валерий', 'Василий',
    'Виктор', 'Виталий', 'Владимир', 'Владислав', 'Геннадий',
    'Георгий', 'Григорий', 'Даниил', 'Денис', 'Дмитрий',
    'Евгений', 'Егор', 'Иван', 'Игорь', 'Илья',
    'Кирилл', 'Константин', 'Леонид', 'Максим', 'Михаил',
    'Никита', 'Николай', 'Олег', 'Павел', 'Петр',
    'Роман', 'Руслан', 'Сергей', 'Станислав', 'Степан',
    'Тимофей', 'Федор', 'Юрий', 'Ярослав'
];

export const femaleFirstNames = [
    'Александра', 'Алена', 'Алина', 'Алла', 'Анастасия',
    'Ангелина', 'Анна', 'Валентина', 'Валерия', 'Варвара',
    'Вера', 'Виктория', 'Галина', 'Дарья', 'Диана',
    'Ева', 'Евгения', 'Екатерина', 'Елена', 'Елизавета',
    'Жанна', 'Злата', 'Инна', 'Ирина', 'Карина',
    'Кира', 'Кристина', 'Ксения', 'Лариса', 'Лидия',
    'Любовь', 'Людмила', 'Маргарита', 'Марина', 'Мария',
    'Надежда', 'Наталья', 'Нина', 'Оксана', 'Олеся',
    'Ольга', 'Полина', 'Раиса', 'Светлана', 'София',
    'Тамара', 'Татьяна', 'Ульяна', 'Юлия', 'Яна'
];

export const maleLastNames = [
    'Иванов', 'Петров', 'Сидоров', 'Смирнов', 'Кузнецов',
    'Попов', 'Васильев', 'Павлов', 'Семенов', 'Голубев',
    'Виноградов', 'Богданов', 'Воробьев', 'Федоров', 'Михайлов',
    'Беляев', 'Тарасов', 'Белов', 'Комаров', 'Орлов',
    'Киселев', 'Макаров', 'Андреев', 'Ковалев', 'Ильин',
    'Гусев', 'Титов', 'Кузьмин', 'Кудрявцев', 'Баранов'
];

export const femaleLastNames = maleLastNames.map(name => name + 'а');

export const malePatronymics = [
    'Александрович', 'Алексеевич', 'Андреевич', 'Антонович', 'Артемович',
    'Борисович', 'Вадимович', 'Валентинович', 'Валериевич', 'Васильевич',
    'Викторович', 'Витальевич', 'Владимирович', 'Владиславович', 'Геннадиевич'
];

export const femalePatronymics = [
    'Александровна', 'Алексеевна', 'Андреевна', 'Антоновна', 'Артемовна',
    'Борисовна', 'Вадимовна', 'Валентиновна', 'Валериевна', 'Васильевна',
    'Викторовна', 'Витальевна', 'Владимировна', 'Владиславовна', 'Геннадиевна'
];

export const romanNumerals = ["I", "II", "III", "IV", "V", "VI", "VII", "VIII", "IX", "X"];
export const cyrillicLetters = "АБВГДЕЖЗИКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";